Repository: Nergal/php-bottle
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: fr

source: Quickstart
fr: Guide de démarrage rapide

source: This short guide will show you how to start a PHP-Bottle project. It should take only a few minutes to make you understand the basics.
fr: Ce court guide vous présentera la création d’un projet PHP-Bottle. Il ne devrait prendre que quelques minutes pour vous faire comprendre les bases.

source: You first need a working PHP5 environment. An HTTP server is not required for development.
fr: Il vous faut tout d’abord un environnement PHP5 fonctionnel. Un serveur HTTP n’est pas requis pour le développement.

source: Create a directory for your application (let’s call it *projectDir*)
fr: Créez un dossier pour votre application (appelons-le *dossierProjet*)

source: Fetch the last PHP-Bottle archive here: https://github.com/nergal/php-bottle/raw/master/build/bottle.phar and put it in the root of *projectDir*
fr: Récupérez l’archive PHP-Bottle ici : https://github.com/nergal/php-bottle/raw/master/build/bottle.phar et placez-le à la racine de votre *dossierProjet*

source: Fetch the *.htaccess* file that will enable URL rewriting here: https://github.com/nergal/php-bottle/raw/master/.htaccess and put it near the *bottle.phar* file.
fr: Récupérez le fichier *.htaccess* qui permettra la réécriture d’URL ici : https://github.com/nergal/php-bottle/raw/master/.htaccess et placez-le près de votre fichier *bottle.phar*.

source: Create a *views* directory in *projectDir*
fr: Créez un dossier *views* dans *dossierProjet*

source: You’re done! Everything is ready to write your first PHP-Bottle page!
fr: C’est fait ! Tout est prêt pour que vous puissiez écrire votre première page avec PHP-Bottle !

source: First page
fr: Première page

source: Okay, last step was too complicated, I got that. So let’s make things simpler: just copy that in a *index.php* file:
fr: Ok, la dernière étape était trop compliquée, j’ai saisi. Alors baissons d’un cran la difficulté : copiez simplement ça dans un fichier *index.php* :

source: Well, was that too hard? We’re ready to test that. Open a terminal, move to *projectDir*, and type:
fr: Bien, c’était si compliqué ? Nous sommes prêts à tester ça. Ouvrez un terminal, déplacez-vous dans *dossierProjet*, et tapez :

source: **Don’t close the terminal yet!** We’ve just started a development HTTP server. Yup, it was embedded in PHP all that time (well, since `PHP 5.4.0`__). Now, just open a web browser to the following URL: http://localhost:8000 . You should see a page welcoming you. Great, that’s a basic hello world, and we didn’t have to write a frawemork to do that!
fr: **Ne fermez pas encore votre terminal !** Nous avons tout juste démarré un serveur de développement PHP. Ouaip, c’était inclus dans PHP depuis tout ce temps (enfin, depuis `PHP 5.4.0`__). Maintenant, il vous suffit d’ouvrir un navigateur web et de charger l’URL http://localhost:8000 . Vous devriez voir une page vous accueillant en anglais. Génial, c’est un bête *hello world*, et il n’était pas nécessaire de développer un framework pour ça !

source: But let’s make something cooler. Like **dynamic URLs**!
fr: Mais nous allons faire quelque chose de plus cool. Comme des **URLs dynamiques** !

source: Dynamic URLs
fr: URLs Dynamiques

source: Did you notice the funny comment just before the *index* function? That’s a **decorator**, but some weird frameworks call that an **annotation**. We’ll keep the first one.
fr: Avez-vous remarqué le drôle de commentaire juste au-dessus de la fonction *index* ? C’est un **décorateur**, mais certains frameworks bizarres appellent ça une **annotation**. On s’en tiendra à la première version.

source: That decorator tells PHP-Bottle when to call that function: in this case, when an URL matching “/” is found. Try this: change that line, replacing “/” by “my/dynamic/url”. Refresh the page (no need to restart the development server we started before), and don’t fear: you just met a 404 error.
fr: Ce décorateur indique à PHP-Bottle quand appeler cette fonction : en l’occurrence, quand une URL correspondant à « / » est trouvée. Essayez ça : modifiez cette ligne, et remplacez « / » par « /mon/url/dynamique ». Rechargez la page (il n’y a pas besoin de redémarrer le serveur de développement que nous avons lancé plus tôt), et ne paniquez pas : vous venez de rencontrer une erreur 404.

source: Why? Because no function (we call these *controllers*) has been registered for the “/” URL. In other words, the requested page is not found.
fr: Pourquoi ? Parce qu’aucune fonction (qu’on appellera **contrôleur**) n’a été enregistré pour traiter l’URL « / ». En d’autres termes, la page demandée est introuvable.

source: But what if you try to get to http://localhost:8000/my/dynamic/url ? Right, your welcome message is here. We changed the *route* decorator, and it literally changed the URL of our page.
fr: Mais que se passe-t-il si vous allez sur la page http://localhost:8000/mon/url/dynamique ? Bien, notre message d’accueil est de nouveau là. Nous avons modifié le décorateur *route*, et il a littéralement modifié l’URL de notre page.

source: For the next step, we should go back to an index page routed on the */* URL. So go back to the “First page” example.
fr: Pour l’étape suivante, il vaut mieux repartir sur l’ancienne version de la page d’index, où celle-ci était routée sur l’URL */*. Alors repartons sur l’exemple « Première page ».

source: Multiple pages
fr: Plusieurs pages

source: Add this to the end of your *index.php* file:
fr: Ajoutez ceci à la fin de votre fichier *index.php* :

source: Look closely at the defined *route* for this controller: it contains a word prefixed by a colon. That means the “:name” is a variable, a dynamic part of a (already dynamic) URL. You can call whatever URL beginning by “/hello/”, and the rest will be in the $name variable. Try it, with http://localhost:8000/hello/world , then replace “world” by your own name.
fr: Regardez attentivement la *route* définie pour ce contrôleur. Elle contient un mot préfixé d’un deux-points. Cela signifie que « :name » est une variable, une partie dynamique d’une URL (elle-même déjà dynamique). Vous pouvez appelez n’importe quelle URL commençant par « /hello/ », et le reste sera passé dans votre variable $name. Essayez ça, avec http://localhost:8000/hello/world, puis remplacez « world » par votre propre nom.

source: You can see that the “:name” part of the URL is indeed given to the *hello()* function as the *$name* argument.
fr: Vous voyez que la partie « :name » de l’URL est effectivement passée en paramètre à la fonction *hello()* en tant que *$name*.
